package Homework_3_31_08_23;
//Подсчет количества вхождений символа в строку (рекурсивно и итеративно)
//Напишите рекурсивную функцию, которая принимает строку и символ, а затем возвращает
// количество вхождений этого символа в строку.
//Например: “hello world”, “l” -> 3
//
//ИЛИ
//
//
//Ханойская башня (рекурсивно и итеративно)
//Задача заключается в следующем. Имеется три стержня — левый, средний и правый. На левом стержне находятся n
// дисков, диаметры которых различны. Диски упорядочены по размеру диаметра, сверху лежит наименьший,
// снизу — наибольший. Требуется перенести диски с левого стержня на правый, используя средний стержень как вспомогательный.
//Головоломка имеет следующие два правила:
//      1. Вы не можете поместить больший диск на меньший диск.
//      2. За один раз можно перемещать только один диск.
public class WordRecursion {
    public static void main(String[] args) {
        String text = "Hello world";
        char charOfText = text.charAt(3);
        System.out.println("Под этим числом буква: " + charOfText);

            }

    public static int fact(int n){
        int count = 0;
        for (int i = 0; i <= 100; i++){
            if (n == 1) return 1;
             }
                    return 1;
           }

    }
